Catalogs/Renault_КонвертацияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КонвертацияДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешниеМетаданные</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.ОбъектыМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПоиска</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Comment>Осуществляет поиск без загрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнешнийРеквизит</Name>
							<Comment>Источник</Comment>
							<Type>
								<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.РеквизитыМД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Comment>Приемник</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоПоиска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоЧтение</Name>
							<Comment>Осуществляет поиск без загрузки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поиск</Name>
							<Comment>Отмечаются реквизиты по которым осуществляется поиск</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_КонвертацияДанных/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда Элементы.Список.РежимВыбора=Истина КонецЕсли;
	ОтборРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Renault_ПередачаДанныхВСторонниеСистемы.ПодключениеУстановлено() Тогда
		Отказ=Истина;
		ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.БазыДанных.Форма.УстановкаПараметровПодключения");
	КонецЕсли;	
	
КонецПроцедуры

//обновление реквизитов
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент) ОтборРеквизитов() КонецПроцедуры
&НаКлиенте
Процедура СписокПриИзменении(Элемент) ОтборРеквизитов() КонецПроцедуры
&НаКлиенте
Процедура СписокПослеУдаления(Элемент) ОтборРеквизитов() КонецПроцедуры

Процедура ОтборРеквизитов()
	ЗначениеОтбора=Элементы.Список.ТекущаяСтрока;
	Реквизиты.Параметры.Элементы[0].Использование=Истина;
	Реквизиты.Параметры.Элементы[0].Значение=?(ЗначениеЗаполнено(ЗначениеОтбора),ЗначениеОтбора,Справочники.Renault_КонвертацияДанных.ПустаяСсылка());
КонецПроцедуры	

&НаКлиенте
Процедура кнВкл(Команда)
	Сп=Новый СписокЗначений; 
	Сп.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки); 
	УстановитьФлаг(?(Команда.Имя="кнВкл",Истина,Ложь),Сп.ВыгрузитьЗначения()); 
	Элементы.Список.Обновить(); 
КонецПроцедуры
Процедура УстановитьФлаг(Флаг,Элементы) 
	Для Каждого Эл Из Элементы Цикл 
		Если НЕ ЗначениеЗаполнено(Эл) Тогда Продолжить КонецЕсли;
		Объект=Эл.ПолучитьОбъект();
		Объект.Активно=Флаг;
		Объект.Записать();
	КонецЦикла 
КонецПроцедуры	

&НаКлиенте
Процедура кнВыполнитьПроверку(Команда) Если Справочники.Renault_КонвертацияДанных.ВыполнитьПроверку(Элементы.Список.ТекущаяСтрока)=Истина Тогда Сообщить("Проверка выполнена успешно",СтатусСообщения.Информация) КонецЕсли; КонецПроцедуры

&НаКлиенте
Процедура кнКонструктор(Команда)
	Оповещение=Новый ОписаниеОповещения("ОповещениеСписка",ЭтаФорма);
	ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.Форма.КонструкторЗаполненияМетаданных",Новый Структура("ТипСоздаваемыхОбъектов","Конвертация"),ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
КонецПроцедуры
Процедура ОповещениеСписка(Парам1,ИдентификаторСтроки) Экспорт Элементы.Список.Обновить() КонецПроцедуры //оповещение о закрытии редактируемой формы элемента списка
